app/controllers/studies_controller.rb

  def index
    @studies = Study.all.order 'date asc'
---
SELECT "studies".* FROM "studies" ORDER BY created_at DESC

  def edit
    @study = Study.find(params[:id])
---
SELECT "studies".* FROM "studies" WHERE "studies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @study = Study.new(study_params)

    respond_to do |format|
      if @study.save
---
INSERT INTO "studies" ("date", "title", "memo", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2021-01-15"], ["title", "Ruby on Rails"], ["memo", "学習記録アプリ「study」の作成"], ["status", 80], ["created_at", "2021-01-15 03:44:33.156090"], ["updated_at", "2021-01-15 03:44:33.156090"]]

  def update
    respond_to do |format|
      if @study.update(study_params)
---
UPDATE "studies" SET "date" = ?, "updated_at" = ? WHERE "studies"."id" = ?  [["date", "2021-01-15"], ["updated_at", "2021-01-15 07:16:09.219409"], ["id", 4]]

  def destroy
    @study.destroy
---
DELETE FROM "studies" WHERE "studies"."id" = ?  [["id", 2]]

    def set_study
      @study = Study.find(params[:id])
---
SELECT "studies".* FROM "studies" WHERE "studies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]